20230918123732-asymmetric_cryptography.org
:PROPERTIES:
:ID:       7745d1fe-f735-4c26-ab14-758ff6e299b2
:END:
#+title: Asymmetric Cryptography

[[id:9e9c3969-d173-4137-8fab-e671aab2f87b][Asymmetric Encryption]]

Works well in untrusted environments but more computationally expensive and complex

aka Public-Key [[id:ff735327-4e77-43b6-8755-50ceccc7f9a0][ciphers]]

Uses different keys to [[id:3389ae98-fd3b-4efc-88d7-e9befaae940c][encrypt]] and [[id:e35c79e8-db3e-4c13-9ad3-1a8f4387fa60][decrypt]]

A process that uses a pair of related keys -- one *public key* and one *private key* -- to encrypt and decrypt a message and protect it from unauthorized access or use.

Very important part of =Asymmetric Cyptography= is [[id:fecb0448-d21e-45d5-b87a-67a261314cba][Public Key Signature]]

* =Asymmetric Cyptography= Allows:
1. Confidentiality (Granted through encryption/decryption mechanism)
2. Authenticity (Digintal Signature mechanism, message wasn't tampered with)
3. Non-repudiation (Came from person claiming to be author)

* Examples
** [[id:e7b70806-c167-4780-80be-16d43ba22fb4][RSA]]
** [[id:954db323-6a0c-4238-895b-994507748e6a][Digital Signature Algorithm (DSA)]]
