20230918123732-asymmetric_cryptography.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Asymmetric Cryptography</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Asymmetric Cryptography</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1183c67">1. <code>Asymmetric Cyptography</code> Allows:</a></li>
<li><a href="#orge09c889">2. Examples</a>
<ul>
<li><a href="#org170acff">2.1. RSA</a></li>
<li><a href="#org463c30a">2.2. Digital Signature Algorithm (DSA)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="20230911070233-asymmetric_encryption.html#ID-9e9c3969-d173-4137-8fab-e671aab2f87b">Asymmetric Encryption</a>
</p>

<p>
Works well in untrusted environments but more computationally expensive and complex
</p>

<p>
aka Public-Key <a href="20230911070425-cipher.html#ID-ff735327-4e77-43b6-8755-50ceccc7f9a0">ciphers</a>
</p>

<p>
Uses different keys to <a href="20230911070400-encryption.html#ID-3389ae98-fd3b-4efc-88d7-e9befaae940c">encrypt</a> and <a href="20230911070513-decryption.html#ID-e35c79e8-db3e-4c13-9ad3-1a8f4387fa60">decrypt</a>
</p>

<p>
A process that uses a pair of related keys &#x2013; one <b>public key</b> and one <b>private key</b> &#x2013; to encrypt and decrypt a message and protect it from unauthorized access or use.
</p>

<p>
Very important part of <code>Asymmetric Cyptography</code> is <a href="20230918125031-public_key_signature.html#ID-fecb0448-d21e-45d5-b87a-67a261314cba">Public Key Signature</a>
</p>

<div id="outline-container-org1183c67" class="outline-2">
<h2 id="org1183c67"><span class="section-number-2">1.</span> <code>Asymmetric Cyptography</code> Allows:</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Confidentiality (Granted through encryption/decryption mechanism)</li>
<li>Authenticity (Digintal Signature mechanism, message wasn't tampered with)</li>
<li>Non-repudiation (Came from person claiming to be author)</li>
</ol>
</div>
</div>

<div id="outline-container-orge09c889" class="outline-2">
<h2 id="orge09c889"><span class="section-number-2">2.</span> Examples</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org170acff" class="outline-3">
<h3 id="org170acff"><span class="section-number-3">2.1.</span> <a href="20230918135033-rsa.html#ID-e7b70806-c167-4780-80be-16d43ba22fb4">RSA</a></h3>
</div>
<div id="outline-container-org463c30a" class="outline-3">
<h3 id="org463c30a"><span class="section-number-3">2.2.</span> <a href="20230918135326-digital_signature_algorithm_dsa.html#ID-954db323-6a0c-4238-895b-994507748e6a">Digital Signature Algorithm (DSA)</a></h3>
</div>
</div>
</div>
</body>
</html>
